In [ ]:
import pip
pip.main(['install', 'pandas'])
pip.main(['install', 'matplotlib'])
pip.main(['install', 'seaborn'])
pip.main(['install', 'scikit-learn'])

CHARGEMENT DES BIBLIOTHEQUES

In [267]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.datasets import make_classification
from sklearn.metrics import roc_curve, auc
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder

CHARGEMENT DU JEU DE DONNEES

In [268]:
dataset_path = "C:\\Users\\belga\\OneDrive\\Bureau\\EMBA Big Data\\Module Datascience\\Projet Data Science S2 2024\\CLIENT.csv"
data1 = pd.read_csv(dataset_path, sep='|', low_memory=False)
print(data1.shape)
print(list(data1.columns))

(845876, 10)
['IDCLIENT', 'CIVILITE', 'DATENAISSANCE', 'MAGASIN', 'DATEDEBUTADHESION', 'DATEREADHESION', 'DATEFINADHESION', 'VIP', 'CODEINSEE', 'PAYS']

La ligne de code ci-dessous nous permet de connaître le détail des colonnes ainsi que le type de données constituant notre base (numérique ou caractères).

In [269]:
data1

,IDCLIENT,CIVILITE,DATENAISSANCE,MAGASIN,DATEDEBUTADHESION,DATEREADHESION,DATEFINADHESION,VIP,CODEINSEE,PAYS
0,155891.0,MADAME,NaN,VLG,13/05/2005 0:00:00,4/04/2017 0:00:00,30/04/2018 0:00:00,0,74224,FR
1,156023.0,MONSIEUR,7/08/1966 0:00:00,VLG,14/05/2005 0:00:00,21/06/2014 0:00:00,30/06/2016 0:00:00,0,74189,FR
2,124203.0,MADAME,NaN,BEA,16/03/2005 0:00:00,12/10/2017 0:00:00,31/10/2018 0:00:00,0,63070,FR
3,156190.0,MADAME,24/07/1976 0:00:00,SUR,28/08/2006 0:00:00,24/05/2015 0:00:00,31/05/2016 0:00:00,0,92026,FR
4,144444.0,MONSIEUR,NaN,LAB,29/04/2006 0:00:00,18/12/2016 0:00:00,31/12/2017 0:00:00,0,31555,FR
...,...,...,...,...,...,...,...,...,...,...
845871,1970111.0,MONSIEUR,NaN,IAB,14/04/2011 0:00:00,6/01/2018 0:00:00,31/01/2019 0:00:00,0,38053,FR
845872,2297275.0,MONSIEUR,6/02/1988 0:00:00,SEM,7/03/2013 0:00:00,6/01/2018 0:00:00,31/01/2019 0:00:00,0,57067,FR
845873,2305548.0,MONSIEUR,NaN,PRI,22/03/2013 0:00:00,6/01/2018 0:00:00,31/01/2019 0:00:00,0,38318,FR
845874,84175.0,MADAME,7/04/1950 0:00:00,GAI,29/10/2002 0:00:00,7/01/2018 0:00:00,31/01/2019 0:00:00,0,74082,FR
845875,1280004.0,MONSIEUR,NaN,SGL,23/06/2007 0:00:00,7/01/2018 0:00:00,31/01/2019 0:00:00,0,42218,FR

In [270]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 845876 entries, 0 to 845875
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   IDCLIENT           845876 non-null  float64
 1   CIVILITE           845876 non-null  object
 2   DATENAISSANCE      507902 non-null  object
 3   MAGASIN            845876 non-null  object
 4   DATEDEBUTADHESION  845876 non-null  object
 5   DATEREADHESION     507816 non-null  object
 6   DATEFINADHESION    845876 non-null  object
 7   VIP                845876 non-null  int64
 8   CODEINSEE          818455 non-null  object
 9   PAYS               845873 non-null  object
dtypes: float64(1), int64(1), object(8)
memory usage: 64.5+ MB

Nous allons procéder à la suppression des clients VIP, qui ont un comportement atypique qui viendra biaiser nos résultats.

In [271]:
# Supprimer les lignes où la valeur de la colonne 'VIP' est égale à 1
data1 = data1[data1['VIP'] != 1]

# Vérifier la nouvelle forme du DataFrame
print(data1.shape)

(735425, 10)

In [272]:
data1 = data1.drop("VIP",axis=1)

Vérification du traitement.

In [273]:
data1

,IDCLIENT,CIVILITE,DATENAISSANCE,MAGASIN,DATEDEBUTADHESION,DATEREADHESION,DATEFINADHESION,CODEINSEE,PAYS
0,155891.0,MADAME,NaN,VLG,13/05/2005 0:00:00,4/04/2017 0:00:00,30/04/2018 0:00:00,74224,FR
1,156023.0,MONSIEUR,7/08/1966 0:00:00,VLG,14/05/2005 0:00:00,21/06/2014 0:00:00,30/06/2016 0:00:00,74189,FR
2,124203.0,MADAME,NaN,BEA,16/03/2005 0:00:00,12/10/2017 0:00:00,31/10/2018 0:00:00,63070,FR
3,156190.0,MADAME,24/07/1976 0:00:00,SUR,28/08/2006 0:00:00,24/05/2015 0:00:00,31/05/2016 0:00:00,92026,FR
4,144444.0,MONSIEUR,NaN,LAB,29/04/2006 0:00:00,18/12/2016 0:00:00,31/12/2017 0:00:00,31555,FR
...,...,...,...,...,...,...,...,...,...
845871,1970111.0,MONSIEUR,NaN,IAB,14/04/2011 0:00:00,6/01/2018 0:00:00,31/01/2019 0:00:00,38053,FR
845872,2297275.0,MONSIEUR,6/02/1988 0:00:00,SEM,7/03/2013 0:00:00,6/01/2018 0:00:00,31/01/2019 0:00:00,57067,FR
845873,2305548.0,MONSIEUR,NaN,PRI,22/03/2013 0:00:00,6/01/2018 0:00:00,31/01/2019 0:00:00,38318,FR
845874,84175.0,MADAME,7/04/1950 0:00:00,GAI,29/10/2002 0:00:00,7/01/2018 0:00:00,31/01/2019 0:00:00,74082,FR
845875,1280004.0,MONSIEUR,NaN,SGL,23/06/2007 0:00:00,7/01/2018 0:00:00,31/01/2019 0:00:00,42218,FR

La ligne de code ci-dessous nous permet de formater le format de la date.

In [274]:
# Adapter le format de date pour les colonnes spécifiées
date_columns = ['DATENAISSANCE', 'DATEDEBUTADHESION', 'DATEREADHESION', 'DATEFINADHESION']
for col in date_columns:
    data1[col] = pd.to_datetime(data1[col], format='%d/%m/%Y %H:%M:%S',errors = 'coerce').dt.strftime('%d/%m/%Y')

Vérification du traitement.

In [275]:
data1

,IDCLIENT,CIVILITE,DATENAISSANCE,MAGASIN,DATEDEBUTADHESION,DATEREADHESION,DATEFINADHESION,CODEINSEE,PAYS
0,155891.0,MADAME,NaN,VLG,13/05/2005,04/04/2017,30/04/2018,74224,FR
1,156023.0,MONSIEUR,07/08/1966,VLG,14/05/2005,21/06/2014,30/06/2016,74189,FR
2,124203.0,MADAME,NaN,BEA,16/03/2005,12/10/2017,31/10/2018,63070,FR
3,156190.0,MADAME,24/07/1976,SUR,28/08/2006,24/05/2015,31/05/2016,92026,FR
4,144444.0,MONSIEUR,NaN,LAB,29/04/2006,18/12/2016,31/12/2017,31555,FR
...,...,...,...,...,...,...,...,...,...
845871,1970111.0,MONSIEUR,NaN,IAB,14/04/2011,06/01/2018,31/01/2019,38053,FR
845872,2297275.0,MONSIEUR,06/02/1988,SEM,07/03/2013,06/01/2018,31/01/2019,57067,FR
845873,2305548.0,MONSIEUR,NaN,PRI,22/03/2013,06/01/2018,31/01/2019,38318,FR
845874,84175.0,MADAME,07/04/1950,GAI,29/10/2002,07/01/2018,31/01/2019,74082,FR
845875,1280004.0,MONSIEUR,NaN,SGL,23/06/2007,07/01/2018,31/01/2019,42218,FR

Cette ligne de code nous permet d'identifier le nombre d'occurence de chaque civilité, pour identifier les éventuels regroupements à effectuer.

In [276]:
#modalités variables:
data1['CIVILITE'].value_counts(dropna = False)

CIVILITE
MADAME      393703
MONSIEUR    337360
Mr            1431
Mme           1284
madame         976
monsieur       671
Name: count, dtype: int64

Il convient de procéder aux regroupements ci-dessous.

In [277]:
#regroupement des modalités:
data1['CIVILITE']=np.where(data1['CIVILITE'] =='MADAME', 'Madame', data1['CIVILITE']) 
data1['CIVILITE']=np.where(data1['CIVILITE'] =='Mme', 'Madame', data1['CIVILITE'])
data1['CIVILITE']=np.where(data1['CIVILITE'] =='madame', 'Madame', data1['CIVILITE']) 
data1['CIVILITE']=np.where(data1['CIVILITE'] =='MONSIEUR', 'Monsieur', data1['CIVILITE'])
data1['CIVILITE']=np.where(data1['CIVILITE'] =='Mr', 'Monsieur', data1['CIVILITE'])
data1['CIVILITE']=np.where(data1['CIVILITE'] =='monsieur', 'Monsieur', data1['CIVILITE'])

Vérification du traitement.

In [278]:
data1['CIVILITE'].value_counts(dropna = False)

CIVILITE
Madame      395963
Monsieur    339462
Name: count, dtype: int64

Cette ligne de code nous permet d'identifier le nombre d'occurence de chaque magasin, pour identifier les éventuels regroupements à effectuer.

In [279]:
data1['MAGASIN'].value_counts(dropna = False)

MAGASIN
PRI    23963
SEY    23572
VIB    22223
SUR    20923
MOU    20887
       ...
VIV     3187
SAL     2836
STR     2667
EST     1145
BAR     1039
Name: count, Length: 67, dtype: int64

Les données à traiter concernant la France, la série de code ci-dessous nous permet de ne conserver que ce pays.

In [280]:
# Filtrer les lignes pour ne garder que celles avec "France" dans la colonne "Pays"
data1 = data1[data1['PAYS'] == 'FR']

# Réindexer le DataFrame après avoir filtré les lignes
data1.reset_index(drop=True, inplace=True)

In [281]:
data1['PAYS'].value_counts(dropna = False)

PAYS
FR    720090
Name: count, dtype: int64

La serie de codes ci-dessous nous permet de traiter la date de naissance des clients afin d'en déterminer l'âge puis des tranches d'âges.

In [ ]:
#Convertir la colonne de date de naissance en objet datetime :

data1['DATENAISSANCE'] = pd.to_datetime(data1['DATENAISSANCE'],errors = 'coerce')

#En créer une nouvelle colonne pour l'âge en calculant la différence entre la date actuelle et la date de naissance :

from datetime import datetime
today = datetime.today()
data1['AGE'] = today.year - data1['DATENAISSANCE'].dt.year
#Discrétiser l'âge en créant des catégories d'âge. Par exemple, diviser en groupes d'âge :
bins = [18, 30, 45, 60, 100]
data1['age_group'] = pd.cut(data1['AGE'], bins, labels=['AGE DE 18-30', 'AGE DE 31-45', 'AGE DE 46-60', 'AGE DE 61-100'])

Vérification du traitement.

In [283]:
data1['age_group'].value_counts(dropna = False)

age_group
NaN              548518
AGE DE 61-100     67546
AGE DE 46-60      57057
AGE DE 31-45      42700
AGE DE 18-30       4269
Name: count, dtype: int64

Après ce traitement, il convient de renommer la variable concernée.

In [284]:
# Renommer la colonne 'DATENAISSANCE' en 'AGE'
data1 = data1.rename(columns={'DATENAISSANCE': 'AGE'})

Vérification du traitement.

In [285]:
data1

,IDCLIENT,CIVILITE,AGE,MAGASIN,DATEDEBUTADHESION,DATEREADHESION,DATEFINADHESION,CODEINSEE,PAYS,AGE,age_group
0,155891.0,Madame,NaT,VLG,13/05/2005,04/04/2017,30/04/2018,74224,FR,NaN,NaN
1,156023.0,Monsieur,1966-07-08,VLG,14/05/2005,21/06/2014,30/06/2016,74189,FR,58.0,AGE DE 46-60
2,124203.0,Madame,NaT,BEA,16/03/2005,12/10/2017,31/10/2018,63070,FR,NaN,NaN
3,156190.0,Madame,NaT,SUR,28/08/2006,24/05/2015,31/05/2016,92026,FR,NaN,NaN
4,144444.0,Monsieur,NaT,LAB,29/04/2006,18/12/2016,31/12/2017,31555,FR,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
720085,1970111.0,Monsieur,NaT,IAB,14/04/2011,06/01/2018,31/01/2019,38053,FR,NaN,NaN
720086,2297275.0,Monsieur,1988-06-02,SEM,07/03/2013,06/01/2018,31/01/2019,57067,FR,36.0,AGE DE 31-45
720087,2305548.0,Monsieur,NaT,PRI,22/03/2013,06/01/2018,31/01/2019,38318,FR,NaN,NaN
720088,84175.0,Madame,1950-07-04,GAI,29/10/2002,07/01/2018,31/01/2019,74082,FR,74.0,AGE DE 61-100
720089,1280004.0,Monsieur,NaT,SGL,23/06/2007,07/01/2018,31/01/2019,42218,FR,NaN,NaN

Afin d'exploiter de façon optimale les informations, nous allons convetir les l'ID TICKET, l'âge et les tranches d'âges en caractère. Nous n'avons pas nécessité à conserver ces valeurs en numérique.

In [286]:
data1['IDCLIENT'] = data1['IDCLIENT'].astype(str)
data1['AGE'] = data1['AGE'].astype(str)
data1['age_group'] = data1['age_group'].astype(str)

Vérification du traitement.

In [287]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 720090 entries, 0 to 720089
Data columns (total 11 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   IDCLIENT           720090 non-null  object
 1   CIVILITE           720090 non-null  object
 2   AGE                720090 non-null  object
 3   MAGASIN            720090 non-null  object
 4   DATEDEBUTADHESION  720090 non-null  object
 5   DATEREADHESION     410990 non-null  object
 6   DATEFINADHESION    720090 non-null  object
 7   CODEINSEE          709392 non-null  object
 8   PAYS               720090 non-null  object
 9   AGE                720090 non-null  object
 10  age_group          720090 non-null  object
dtypes: object(11)
memory usage: 60.4+ MB

La ligne de code ci-dessous nous permet d'identifier les valeurs en doublons qui conviendra de traiter.

In [288]:
print(data1.duplicated().sum())
data1 = data1.drop_duplicates()

0

Nous procédons également à la vérification de présence ou non de valeurs manquantes.

In [289]:
pd.DataFrame(index=data1.columns, columns=['%_missing_values'], data= (data1.isna().sum().values / len(data1)*100))

                   %_missing_values
IDCLIENT                   0.000000
CIVILITE                   0.000000
AGE                        0.000000
MAGASIN                    0.000000
DATEDEBUTADHESION          0.000000
DATEREADHESION            42.925190
DATEFINADHESION            0.000000
CODEINSEE                  1.485648
PAYS                       0.000000
AGE                        0.000000
age_group                  0.000000

La série de codes ci-dessous nous permet de traiter les valeurs manquantes détéctées, sur les variables concernées.

In [290]:
data1['CODEINSEE'].isnull()

0         False
1         False
2         False
3         False
4         False
          ...
720085    False
720086    False
720087    False
720088    False
720089    False
Name: CODEINSEE, Length: 720090, dtype: bool

In [291]:
data1.dropna(subset=['CODEINSEE'], inplace=True)

In [292]:
data1['DATEREADHESION'].isnull()

0         False
1         False
2         False
3         False
4         False
          ...
720085    False
720086    False
720087    False
720088    False
720089    False
Name: DATEREADHESION, Length: 709392, dtype: bool

In [293]:
data1.dropna(subset=['DATEREADHESION'], inplace=True)

In [294]:
data1['age_group'].isnull()

0         False
1         False
2         False
3         False
4         False
          ...
720085    False
720086    False
720087    False
720088    False
720089    False
Name: age_group, Length: 407389, dtype: bool

In [295]:
data1['age_group'].value_counts()

age_group
nan              326057
AGE DE 61-100     39498
AGE DE 46-60      27990
AGE DE 31-45      13240
AGE DE 18-30        604
Name: count, dtype: int64

In [296]:
data1['age_group'] = data1['age_group'].replace(np.nan, "Inconnue")

In [297]:
data1['age_group']=data1[['age_group']].applymap(lambda x: "Inconnue" if x=='nan' else x)

C:\Users\belga\AppData\Local\Temp\ipykernel_24944\2919579232.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  data1['age_group']=data1[['age_group']].applymap(lambda x: "Inconnue" if x=='nan' else x)

In [298]:
data1['age_group'].value_counts()

age_group
Inconnue         326057
AGE DE 61-100     39498
AGE DE 46-60      27990
AGE DE 31-45      13240
AGE DE 18-30        604
Name: count, dtype: int64

In [299]:
data1.dropna(subset=['age_group'], inplace=True)

Vérification du taitement.

In [300]:
pd.DataFrame(index=data1.columns, columns=['%_missing_values'], data= (data1.isna().sum().values / len(data1)*100))

                   %_missing_values
IDCLIENT                        0.0
CIVILITE                        0.0
AGE                             0.0
MAGASIN                         0.0
DATEDEBUTADHESION               0.0
DATEREADHESION                  0.0
DATEFINADHESION                 0.0
CODEINSEE                       0.0
PAYS                            0.0
AGE                             0.0
age_group                       0.0

Le traitement des valeurs aberrantes ne concernant que les variables numériques, nous n'allons pas procéder à ce traitement car aucune de nos variables n'est concernées sur ce dataframe.

Suppression des colonnes dont les informations nous serons pas nécessairement utiles dans le cadre de notre projet.

In [301]:
data1.drop(columns=['PAYS'], inplace=True)

In [302]:
data1.drop(columns=['AGE'], inplace=True)

In [303]:
data1

,IDCLIENT,CIVILITE,MAGASIN,DATEDEBUTADHESION,DATEREADHESION,DATEFINADHESION,CODEINSEE,age_group
0,155891.0,Madame,VLG,13/05/2005,04/04/2017,30/04/2018,74224,Inconnue
1,156023.0,Monsieur,VLG,14/05/2005,21/06/2014,30/06/2016,74189,AGE DE 46-60
2,124203.0,Madame,BEA,16/03/2005,12/10/2017,31/10/2018,63070,Inconnue
3,156190.0,Madame,SUR,28/08/2006,24/05/2015,31/05/2016,92026,Inconnue
4,144444.0,Monsieur,LAB,29/04/2006,18/12/2016,31/12/2017,31555,Inconnue
...,...,...,...,...,...,...,...,...
720085,1970111.0,Monsieur,IAB,14/04/2011,06/01/2018,31/01/2019,38053,Inconnue
720086,2297275.0,Monsieur,SEM,07/03/2013,06/01/2018,31/01/2019,57067,AGE DE 31-45
720087,2305548.0,Monsieur,PRI,22/03/2013,06/01/2018,31/01/2019,38318,Inconnue
720088,84175.0,Madame,GAI,29/10/2002,07/01/2018,31/01/2019,74082,AGE DE 61-100
720089,1280004.0,Monsieur,SGL,23/06/2007,07/01/2018,31/01/2019,42218,Inconnue

La série de codes ci-dessous nous permet de modifier le format des dates de début et de fin d'adhésion afin de calculer l'ancienneté des clients.

In [304]:
import datetime
from datetime import timedelta

In [305]:
data1['DATEDEBUTADHESION'] = pd.to_datetime(data1['DATEDEBUTADHESION'])

C:\Users\belga\AppData\Local\Temp\ipykernel_24944\1125558055.py:1: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  data1['DATEDEBUTADHESION'] = pd.to_datetime(data1['DATEDEBUTADHESION'])

In [306]:
data1['DATEDEBUTADHESION'] = data1['DATEDEBUTADHESION'].dt.year.astype(int)

In [307]:
data1['DATEFINADHESION'] = pd.to_datetime(data1['DATEFINADHESION'])

C:\Users\belga\AppData\Local\Temp\ipykernel_24944\124944321.py:1: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  data1['DATEFINADHESION'] = pd.to_datetime(data1['DATEFINADHESION'])

In [308]:
data1['DATEFINADHESION'] = data1['DATEFINADHESION'].dt.year.astype(int)

In [309]:
if 'DATEDEBUTADHESION' in data1.columns:
    Date_début = data1['DATEDEBUTADHESION']
    print(Date_début.head())
else:
    print("La colonne 'DATEDEBUTADHESION' n'existe pas dans le DataFrame.")

0    2005
1    2005
2    2005
3    2006
4    2006
Name: DATEDEBUTADHESION, dtype: int32

In [310]:
if 'DATEFINADHESION' in data1.columns:
    Date_fin = data1['DATEFINADHESION']
    print(Date_fin.head())
else:
    print("La colonne 'DATEFINADHESION' n'existe pas dans le DataFrame.")

0    2018
1    2016
2    2018
3    2016
4    2017
Name: DATEFINADHESION, dtype: int32

In [311]:
ANCIENNETE = Date_fin - Date_début

In [312]:
print(ANCIENNETE)

0         13
1         11
2         13
3         10
4         11
          ..
720085     8
720086     6
720087     6
720088    17
720089    12
Length: 407389, dtype: int32

Nous allons maintenant intégrer cette variables d'ancienneté à notre jeu de données.

In [313]:
data1.insert(loc=6, column='ANCIENNETE', value=ANCIENNETE)

In [314]:
data1

,IDCLIENT,CIVILITE,MAGASIN,DATEDEBUTADHESION,DATEREADHESION,DATEFINADHESION,ANCIENNETE,CODEINSEE,age_group
0,155891.0,Madame,VLG,2005,04/04/2017,2018,13,74224,Inconnue
1,156023.0,Monsieur,VLG,2005,21/06/2014,2016,11,74189,AGE DE 46-60
2,124203.0,Madame,BEA,2005,12/10/2017,2018,13,63070,Inconnue
3,156190.0,Madame,SUR,2006,24/05/2015,2016,10,92026,Inconnue
4,144444.0,Monsieur,LAB,2006,18/12/2016,2017,11,31555,Inconnue
...,...,...,...,...,...,...,...,...,...
720085,1970111.0,Monsieur,IAB,2011,06/01/2018,2019,8,38053,Inconnue
720086,2297275.0,Monsieur,SEM,2013,06/01/2018,2019,6,57067,AGE DE 31-45
720087,2305548.0,Monsieur,PRI,2013,06/01/2018,2019,6,38318,Inconnue
720088,84175.0,Madame,GAI,2002,07/01/2018,2019,17,74082,AGE DE 61-100
720089,1280004.0,Monsieur,SGL,2007,07/01/2018,2019,12,42218,Inconnue

Ci-dessous, nous procédons à la suppression des dates de début et de fin d'adhésion car nous n'en avons plus besoin.

In [315]:
data1.drop(columns=['DATEDEBUTADHESION'], inplace=True)

In [316]:
data1.drop(columns=['DATEFINADHESION'], inplace=True)

Vérification des traitements.

In [331]:
data1

,IDCLIENT,CIVILITE,MAGASIN,DATEREADHESION,ANCIENNETE,CODEINSEE,age_group,ANCIENNETE_RETRA
0,155891.0,Madame,VLG,2017-04-04,13,74224,Inconnue,13
1,156023.0,Monsieur,VLG,2014-06-21,11,74189,AGE DE 46-60,11
2,124203.0,Madame,BEA,2017-10-12,13,63070,Inconnue,13
3,156190.0,Madame,SUR,2015-05-24,10,92026,Inconnue,10
4,144444.0,Monsieur,LAB,2016-12-18,11,31555,Inconnue,11
...,...,...,...,...,...,...,...,...
720085,1970111.0,Monsieur,IAB,2018-01-06,8,38053,Inconnue,Inconnue
720086,2297275.0,Monsieur,SEM,2018-01-06,6,57067,AGE DE 31-45,Inconnue
720087,2305548.0,Monsieur,PRI,2018-01-06,6,38318,Inconnue,Inconnue
720088,84175.0,Madame,GAI,2018-01-07,17,74082,AGE DE 61-100,Inconnue
720089,1280004.0,Monsieur,SGL,2018-01-07,12,42218,Inconnue,Inconnue

In [329]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 407389 entries, 0 to 720089
Data columns (total 8 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   IDCLIENT          407389 non-null  object
 1   CIVILITE          407389 non-null  object
 2   MAGASIN           407389 non-null  object
 3   DATEREADHESION    407389 non-null  datetime64[ns]
 4   ANCIENNETE        407389 non-null  int32
 5   CODEINSEE         407389 non-null  object
 6   age_group         407389 non-null  object
 7   ANCIENNETE_RETRA  407389 non-null  object
dtypes: datetime64[ns](1), int32(1), object(6)
memory usage: 42.5+ MB

Le code ci-dessous va également nous permettre de modifier le format de la date de ré-adhésion.

In [328]:
data1["DATEREADHESION"] = pd.to_datetime(data1['DATEREADHESION'].str.strip(), format='%d/%m/%Y')

Puis, nous supprimons les dates de ré-adhésion post 2017 car le périmètre temps de notre projet de dépasse pas l'année 2017.

In [330]:
data1['ANCIENNETE_RETRA'] = np.where(data1['DATEREADHESION'] >= "01/01/2018", 'Inconnue', data1['ANCIENNETE'])

In [ ]:
import pip
pip.main(['install', 'pandas'])
pip.main(['install', 'matplotlib'])
pip.main(['install', 'seaborn'])
pip.main(['install', 'scikit-learn'])

Chargement des bibliothèques

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.datasets import make_classification
from sklearn.metrics import roc_curve, auc
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder

Chargement du jeu de données.

In [7]:
dataset_path = "C:\\Users\\belga\\OneDrive\\Bureau\\EMBA Big Data\\Module Datascience\\Projet Data Science S2 2024\\Donnees_communales_2020_INSEE.csv"
data6 = pd.read_csv(dataset_path, sep=';', low_memory=False,encoding='latin-1')
print(data6.shape)
print(list(data6.columns))

(34945, 26)
['Code', 'Libellé', 'Région', 'Département', 'Emploi total', 'Administration publique', 'Agriculture', 'Bâtiment-Travaux Publics', 'Commerce inter-entreprises', 'Conception, Recherche', 'Culture, Loisirs', 'Distribution', 'Education, Formation', 'Entretien, Réparation', 'Fabrication', 'Gestion', 'Transports, Logistique', 'Prestations Intellectuelles', 'Santé, Action Sociale', 'Services de Proximité', 'Commerce \ninter-entreprises', 'Conception, Recherche.1', 'Culture, Loisirs.1', 'Gestion.1', 'Prestations Intellectuelles.1', 'Total']

La ligne de code ci-dessous nous permet de connaître le détail des colonnes ainsi que le type de données constituant notre base (numérique ou caractères).

In [8]:
data6

,Code,Libellé,Région,Département,Emploi total,Administration publique,Agriculture,Bâtiment-Travaux Publics,Commerce inter-entreprises,"Conception, Recherche",...,"Transports, Logistique",Prestations Intellectuelles,"Santé, Action Sociale",Services de Proximité,Commerce \ninter-entreprises,"Conception, Recherche.1","Culture, Loisirs.1",Gestion.1,Prestations Intellectuelles.1,Total
0,1001,L'Abergement-Clémenciat,84,1,72,5,5,14,5,0,...,0,0,0,14,0,0,0,0,0,0
1,1002,L'Abergement-de-Varey,84,1,25,0,15,0,0,0,...,0,0,0,0,0,0,4,0,0,4
2,1004,Ambérieu-en-Bugey,84,1,7 697,842,23,514,229,79,...,1 017,247,808,630,46,53,42,155,84,380
3,1005,Ambérieux-en-Dombes,84,1,332,5,4,59,10,0,...,0,5,54,35,5,0,5,5,0,15
4,1006,Ambléon,84,1,5,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
34940,97613,M'Tsangamouji,6,976,495,128,10,77,0,0,...,15,5,15,45,0,0,0,0,0,0
34941,97614,Ouangani,6,976,1 254,168,67,155,0,5,...,48,13,90,105,0,3,5,10,8,25
34942,97615,Pamandzi,6,976,1 642,460,10,55,10,10,...,125,27,72,200,3,5,35,10,10,62
34943,97616,Sada,6,976,1 447,175,45,210,0,0,...,117,8,35,190,0,0,5,15,3,23
34944,97617,Tsingoni,6,976,2 223,399,58,391,8,24,...,120,21,92,245,0,0,3,10,3,15

In [9]:
data6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34945 entries, 0 to 34944
Data columns (total 26 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Code                           34945 non-null  object
 1   Libellé                        34945 non-null  object
 2   Région                         34945 non-null  int64
 3   Département                    34945 non-null  object
 4   Emploi total                   34945 non-null  object
 5   Administration publique        34945 non-null  object
 6   Agriculture                    34945 non-null  object
 7   Bâtiment-Travaux Publics       34945 non-null  object
 8   Commerce inter-entreprises     34945 non-null  object
 9   Conception, Recherche          34945 non-null  object
 10  Culture, Loisirs               34945 non-null  object
 11  Distribution                   34945 non-null  object
 12  Education, Formation           34945 non-null  object
 13  Entretien, Réparation          34945 non-null  object
 14  Fabrication                    34945 non-null  object
 15  Gestion                        34945 non-null  object
 16  Transports, Logistique         34945 non-null  object
 17  Prestations Intellectuelles    34945 non-null  object
 18  Santé, Action Sociale          34945 non-null  object
 19  Services de Proximité          34945 non-null  object
 20  Commerce
inter-entreprises    34945 non-null  object
 21  Conception, Recherche.1        34945 non-null  object
 22  Culture, Loisirs.1             34945 non-null  object
 23  Gestion.1                      34945 non-null  object
 24  Prestations Intellectuelles.1  34945 non-null  object
 25  Total                          34945 non-null  object
dtypes: int64(1), object(25)
memory usage: 6.9+ MB

Afin d'exploiter de façon optimale les informations, nous allons convetir les codes postaux en caractère. Nous n'avons pas nécessité à conserver ces valeurs en numérique.

In [10]:
data6['Région'] = data6['Région'].astype(str)

Vérification du traitement

In [11]:
data6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34945 entries, 0 to 34944
Data columns (total 26 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Code                           34945 non-null  object
 1   Libellé                        34945 non-null  object
 2   Région                         34945 non-null  object
 3   Département                    34945 non-null  object
 4   Emploi total                   34945 non-null  object
 5   Administration publique        34945 non-null  object
 6   Agriculture                    34945 non-null  object
 7   Bâtiment-Travaux Publics       34945 non-null  object
 8   Commerce inter-entreprises     34945 non-null  object
 9   Conception, Recherche          34945 non-null  object
 10  Culture, Loisirs               34945 non-null  object
 11  Distribution                   34945 non-null  object
 12  Education, Formation           34945 non-null  object
 13  Entretien, Réparation          34945 non-null  object
 14  Fabrication                    34945 non-null  object
 15  Gestion                        34945 non-null  object
 16  Transports, Logistique         34945 non-null  object
 17  Prestations Intellectuelles    34945 non-null  object
 18  Santé, Action Sociale          34945 non-null  object
 19  Services de Proximité          34945 non-null  object
 20  Commerce
inter-entreprises    34945 non-null  object
 21  Conception, Recherche.1        34945 non-null  object
 22  Culture, Loisirs.1             34945 non-null  object
 23  Gestion.1                      34945 non-null  object
 24  Prestations Intellectuelles.1  34945 non-null  object
 25  Total                          34945 non-null  object
dtypes: object(26)
memory usage: 6.9+ MB

Suppression des colonnes dont les informations nous serons pas nécessairement utiles dans le cadre de notre projet.

La ligne de code ci-dessous nous permet d'identifier les valeurs en doublons qui conviendra de traiter.

In [12]:
print(data6.duplicated().sum())
data6 = data6.drop_duplicates()

0

Nous procédons également à la vérification de présence ou non de valeurs manquantes.

In [13]:
pd.DataFrame(index=data6.columns, columns=['%_missing_values'], data= (data6.isna().sum().values / len(data6)*100))

                               %_missing_values
Code                                        0.0
Libellé                                     0.0
Région                                      0.0
Département                                 0.0
Emploi total                                0.0
Administration publique                     0.0
Agriculture                                 0.0
Bâtiment-Travaux Publics                    0.0
Commerce inter-entreprises                  0.0
Conception, Recherche                       0.0
Culture, Loisirs                            0.0
Distribution                                0.0
Education, Formation                        0.0
Entretien, Réparation                       0.0
Fabrication                                 0.0
Gestion                                     0.0
Transports, Logistique                      0.0
Prestations Intellectuelles                 0.0
Santé, Action Sociale                       0.0
Services de Proximité                       0.0
Commerce \ninter-entreprises                0.0
Conception, Recherche.1                     0.0
Culture, Loisirs.1                          0.0
Gestion.1                                   0.0
Prestations Intellectuelles.1               0.0
Total                                       0.0

Le traitement des valeurs aberrantes ne concernant que les variables numériques, nous n'allons pas procéder à ce traitement car aucune de nos variables n'est concernées sur ce dataframe.